## ETL - ATO & DSS data

- UWA Boot Camp Data Analytics

- ETL Project - 30 November 2020

- Group-06 -- Cyrus Au Yeung | Lily Smith | Warren Villarosa | Anthony van der Wal

---

___
# Purpose

To create a database in order to retrieve data for investigating the relationship of location by postcode on a few economic indicators. This database would collect mean and median income as well as wages by postcode. We wanted to compare these against a few key tax breaks and government safety nets by postcode in order to investigate the correlation, if any, between the data sets.

We believe that the data in the database could be used for future visualizations showing geographic relationships. We believe that there may be some inversely proportional relationships between safety nets and income. We would also be interested in investigating the effect that family tax benefit a and b have on total income.

In [1]:
# Dependencies
import pandas as pd
from sqlalchemy import create_engine
from config import pg_pwd

---
# Extract

---
## ATO -- CSV to dataframe
- data.gov.au
- https://data.gov.au/data/dataset/taxation-statistics-2015-16/resource/859d8053-7f62-4bd7-82ed-8c1cd9156a2b

In [2]:
#Import CSV to Dataframe

ato_file = "01-sources/taxstats2015individual28countaveragemedianbypostcode.csv"
ato_df = pd.read_csv(ato_file)
ato_df

,Postcode,Count taxable income or loss,Average taxable income or loss,Median taxable income or loss,Count salary and wages,Average salary and wages,Median salary and wages,Count net rent,Average net rent,Median net rent,...,Median total business income,Count total business expenses,Average total business expenses,Median total business expenses,Count net tax,Average net tax,Median net tax,Count super total accounts balance,Average super total accounts balance,Median super total accounts balance
0,2000,36185,47723,18213,31293,38710,17992,3614,558,207,...,19684,1331,222191,20773,17264,27555,5917,51394,68531,1110
1,2006,83,80905,58150,74,82733,67658,21,1042,-807,...,42054,4,48971,18508,67,28142,19359,137,90315,15544
2,2007,4769,46549,31474,4153,47386,34366,548,-1242,-794,...,19960,334,639499,9233,3071,15649,9115,6711,41670,5225
3,2008,5607,108816,41151,5008,53418,42892,612,1818,-1728,...,19722,481,32173,9385,4061,53976,10583,7676,54245,10373
4,2009,9726,82938,50604,8167,74068,55243,1714,-2412,-1520,...,26044,666,222993,11982,7358,32430,14835,12718,126486,20494
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2468,870,13409,57704,50609,12299,57827,52378,2515,-3284,-2657,...,24872,872,44687,11366,11050,14788,10804,12755,97068,39639
2469,872,3520,39965,31883,3389,36355,29379,301,-4788,-2593,...,12528,66,45670,8498,2314,9017,4614,3328,40555,12492
2470,880,633,56522,42004,586,57525,43230,179,-4964,-3732,...,12871,39,28700,6047,460,16574,10758,588,90488,32574
2471,885,600,86713,68314,563,88820,75159,239,-8280,-5498,...,26190,25,39850,7807,491,28795,21326,586,127863,71318
2472,886,808,63557,53781,772,65861,56291,192,-5081,-3146,...,33796,26,90120,18718,634,18141,14250,774,91023,50926

---
## DSS -- CSV to dataframe

In [3]:
dss_file = "01-sources/dss-demogrphics-march-2015.csv"
dss_df = pd.read_csv(dss_file, header=None)
dss_df

,0,1,2,3,4,5,6,7,8,9,...,54,55,56,57,58,59,60,61,62,63
0,Payment recipients by postcode and payment typ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Postcode,ABSTUDY (Living allowance),ABSTUDY (Non-living allowance),Age Pension,Austudy,Carer Allowance,Carer Allowance (Child Health Care Card only),Carer Payment,Double Orphan Pension,Disability Support Pension,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,200,0,0,0,<20,0,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,800,<20,<20,176,<20,24,0,<20,<20,292,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5903,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5904,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5905,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5906,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5907,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

---
# Transform

___
## ATO DF Transform

### Methodology

<b>1.)</b>There were multiple columns of superflous data for the purposes of our database so we narrowed the selection to the information we wanted

<b>2.)</b>Simplified column names for easier data retrieval

<b>3.)</b>We then set the postcode to the index in preparation for upload.

In [4]:
#Import only columns relevant to the database from the dataframe.

ato_df = ato_df[['Postcode', 
                 'Average taxable income or loss',
                'Median taxable income or loss',
                'Average salary and wages',
                'Median salary and wages']]
ato_df.columns = ['postcode', 'avg_income', 'med_income', 'avg_salary', 'med_salary']
ato_df

      postcode  avg_income  med_income  avg_salary  med_salary
0         2000       47723       18213       38710       17992
1         2006       80905       58150       82733       67658
2         2007       46549       31474       47386       34366
3         2008      108816       41151       53418       42892
4         2009       82938       50604       74068       55243
...        ...         ...         ...         ...         ...
2468       870       57704       50609       57827       52378
2469       872       39965       31883       36355       29379
2470       880       56522       42004       57525       43230
2471       885       86713       68314       88820       75159
2472       886       63557       53781       65861       56291

[2473 rows x 5 columns]

In [5]:
#Set index to postcode in preparation for upload

ato_df = ato_df.set_index('postcode', drop=True)  # set index to postcodes
ato_df

          avg_income  med_income  avg_salary  med_salary
postcode
2000           47723       18213       38710       17992
2006           80905       58150       82733       67658
2007           46549       31474       47386       34366
2008          108816       41151       53418       42892
2009           82938       50604       74068       55243
...              ...         ...         ...         ...
870            57704       50609       57827       52378
872            39965       31883       36355       29379
880            56522       42004       57525       43230
885            86713       68314       88820       75159
886            63557       53781       65861       56291

[2473 rows x 4 columns]

In [6]:
# Check for duplicated rows
ato_df.loc[ato_df.index.duplicated(keep=False) == True]

Empty DataFrame
Columns: [avg_income, med_income, avg_salary, med_salary]
Index: []

___
## DSS DF Transform

### Methodology

<b>1.)</b>Extra rows were present during the upload. The first step was to take the values from row 3 and use them as the titles.

<b>2.)</b>Narrowed the columns to data relevant to the databases intention.

<b>3.)</b>Dropped rows with irrelevant or Null data.

<b>4.)</b>We then set the postcode to the index in preparation for upload

In [7]:
# Rename columns and drop first few rows
dss_df.columns = dss_df.iloc[2]  # rename columns to values from 3 row
dss_df = dss_df[['Postcode', 'Age Pension', 'Austudy', 'Disability Support Pension', 'Family Tax Benefit A', 'Family Tax Benefit B']]
dss_df.columns = ['postcode', 'age_pension', 'austudy', 'disability_support', 'tax_a', 'tax_b']
dss_df

,postcode,age_pension,austudy,disability_support,tax_a,tax_b
0,Payment recipients by postcode and payment typ...,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN
2,Postcode,Age Pension,Austudy,Disability Support Pension,Family Tax Benefit A,Family Tax Benefit B
3,200,0,<20,0,0,0
4,800,176,<20,292,136,123
...,...,...,...,...,...,...
5903,NaN,NaN,NaN,NaN,NaN,NaN
5904,NaN,NaN,NaN,NaN,NaN,NaN
5905,NaN,NaN,NaN,NaN,NaN,NaN
5906,NaN,NaN,NaN,NaN,NaN,NaN
5907,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
dss_df = dss_df.drop([0,1,2])  # drop first 3 rows of rubbish
dss_df = dss_df[dss_df['postcode'].notna()]  # drop rows with null values
dss_df = dss_df.loc[:, dss_df.columns.notnull()]  # drop columns with null values
dss_df = dss_df.set_index('postcode', drop=True)  # set index to postcodes
dss_df

         age_pension austudy disability_support      tax_a      tax_b
postcode
200                0     <20                  0          0          0
800              176     <20                292        136        123
801              <20       0                 28        <20        <20
803              <20       0                  0          0          0
804              <20       0                <20        <20        <20
...              ...     ...                ...        ...        ...
8006               0       0                  0          0          0
8012               0       0                  0          0          0
9726               0       0                <20        <20        <20
Unknown       85,156      28              7,437        839        674
Total      2,470,880  43,982            819,455  1,522,873  1,332,238

[2919 rows x 5 columns]

In [9]:
# Check for duplicated rows
dss_df.loc[dss_df.index.duplicated(keep=False) == True]

Empty DataFrame
Columns: [age_pension, austudy, disability_support, tax_a, tax_b]
Index: []

___
# LOAD

___
## Methodology

1.) Create database in PGAdmin and load tables using SQL Schema Below

2.) Use Jupyter notebooks to load pandas dataframe into the tables

3.) Test a Join Using SQL Query

## SQL SCHEMA

-- Drop tables if existing<br>
DROP TABLE IF EXISTS ato;<br>
DROP TABLE IF EXISTS dss;<br>
-- Create tables for raw data to be loaded into<br>
CREATE TABLE ato (<br>
postcode VARCHAR PRIMARY KEY,<br>
avg_income INT,<br>
med_income INT,<br>
avg_salary INT,<br>
med_salary INT<br>
);<br>
CREATE TABLE dss (<br>
postcode VARCHAR PRIMARY KEY,<br>
age_pension VARCHAR,<br>
austudy VARCHAR,<br>
disability_support VARCHAR,<br>
tax_a VARCHAR,<br>
tax_b VARCHAR<br>
);<br>
-- Joins tables<br>
SELECT ato.postcode, ato.med_income, dss.age_pension<br>
FROM ato<br>
JOIN dss<br>
ON ato.postcode = dss.postcode;<br>

In [10]:
# Connect to postrges database
engine = create_engine(f'postgresql://postgres:{pg_pwd}@localhost:5432/etl-project')
connection = engine.connect()

In [11]:
#Check Tables have been created in Postgres
engine.table_names()

['ato', 'dss']

___
## Load ATO DataFrame into PostGres SQL Server

In [12]:
#Delete From ATO

engine.execute("DELETE FROM ato")

#Append dataframe information into Postgres SQL Tables

ato_df.to_sql('ato', connection, if_exists='append', index=True, index_label='postcode')

___
## Load DSS DataFrame into PostGres SQL Server

In [13]:
#Delete From DSS

engine.execute("DELETE FROM dss")

#Append dataframe information into Postgres SQL Tables

dss_df.to_sql('dss', connection, if_exists='append', index=True, index_label='postcode')

___
# Test data retrieval from server

In [14]:
#Create a dataframe using a database query to check that database is working.

ato_pga_df = pd.read_sql("SELECT * FROM ato", connection)
ato_pga_df

     postcode  avg_income  med_income  avg_salary  med_salary
0        2000       47723       18213       38710       17992
1        2006       80905       58150       82733       67658
2        2007       46549       31474       47386       34366
3        2008      108816       41151       53418       42892
4        2009       82938       50604       74068       55243
...       ...         ...         ...         ...         ...
2468      870       57704       50609       57827       52378
2469      872       39965       31883       36355       29379
2470      880       56522       42004       57525       43230
2471      885       86713       68314       88820       75159
2472      886       63557       53781       65861       56291

[2473 rows x 5 columns]

In [15]:
#Create a dataframe using a database query to check that database is working.

dss_pga_df = pd.read_sql("SELECT * FROM dss", connection)
dss_pga_df

     postcode age_pension austudy disability_support      tax_a      tax_b
0         200           0     <20                  0          0          0
1         800         176     <20                292        136        123
2         801         <20       0                 28        <20        <20
3         803         <20       0                  0          0          0
4         804         <20       0                <20        <20        <20
...       ...         ...     ...                ...        ...        ...
2914     8006           0       0                  0          0          0
2915     8012           0       0                  0          0          0
2916     9726           0       0                <20        <20        <20
2917  Unknown      85,156      28              7,437        839        674
2918    Total   2,470,880  43,982            819,455  1,522,873  1,332,238

[2919 rows x 6 columns]

In [21]:
#Counts By state
Counts_df = pd.read_sql("SELECT substr(postcode,1,1) AS start_char, COUNT(*) FROM ato GROUP BY substr(postcode,1,1);", connection)
Counts_df

  start_char  count
0          6    322
1          5    311
2          7    106
3          2    625
4          8     29
5          4    419
6          3    661

# Aggregation

In [33]:
Counts_df['start_char'].astype(int)

0    6
1    5
2    7
3    2
4    8
5    4
6    3
Name: start_char, dtype: int64

In [46]:
Counts_df.at[0,"start_char"]="WA"
Counts_df.at[1,"start_char"]="SA"
Counts_df.at[2,"start_char"]="TAS"
Counts_df.at[3,"start_char"]="NSW"
Counts_df.at[4,"start_char"]="NT"
Counts_df.at[5,"start_char"]="QLD"
Counts_df.at[6,"start_char"]="VIC"

Counts_df = Counts_df.rename(columns={'start_char': 'State', 'count': 'Count'})
Counts_df = Counts_df.set_index('State', drop=True)
Counts_df

       Count
State
WA       322
SA       311
TAS      106
NSW      625
NT        29
QLD      419
VIC      661